request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:gs="http://tinkoff.test/producing">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:findNumberRequest>
         <gs:number>231</gs:number>
      </gs:findNumberRequest>
   </soapenv:Body>
</soapenv:Envelope>